# Unsupervised Learning in Python

## Clustering for Dataset Exploration

In [1]:
import pandas as pd

In [12]:
df = pd.DataFrame({
  'winners': ['Argentina', 'France', 'Germany', 'Spain', 'Italy', 'Brazil', 'England', 'Uruguay'],
  'Years': [  [2022,1986,1978],
              [2018,1998],
              [2014,1990,1974,1954],
              [2010],
              [2006,1982,1938,1934],
              [2002,1994,1970,1962,1958],
              [1966],
              [1950,1930]
          ]
})
df

     winners                           Years
0  Argentina              [2022, 1986, 1978]
1     France                    [2018, 1998]
2    Germany        [2014, 1990, 1974, 1954]
3      Spain                          [2010]
4      Italy        [2006, 1982, 1938, 1934]
5     Brazil  [2002, 1994, 1970, 1962, 1958]
6    England                          [1966]
7    Uruguay                    [1950, 1930]

In [13]:
df = df.explode('Years', ignore_index=True)[['Years', 'winners']].sort_values(by='Years', ascending=False).reset_index(drop=True)
df

   Years    winners
0   2022  Argentina
1   2018     France
2   2014    Germany
3   2010      Spain
4   2006      Italy
5   2002     Brazil
6   1998     France
7   1994     Brazil
8   1990    Germany
9   1986  Argentina
10  1982      Italy
11  1978  Argentina
12  1974    Germany
13  1970     Brazil
14  1966    England
15  1962     Brazil
16  1958     Brazil
17  1954    Germany
18  1950    Uruguay
19  1938      Italy
20  1934      Italy
21  1930    Uruguay

In [ ]:
lst = [ (yr, df.loc[_,'winners']) for _ in range(len(df)) for yr in df.loc[_,'Years'] ]
lst = pd.DataFrame( sorted(lst, key=lambda x:a x[0], reverse=True) , columns=['Year', 'Winner'] )
lst

In [ ]:
pd.DataFrame(lst, columns=['Year','Winner'])

In [ ]:
lst = []
for _ in range(len(df)):
  for yr in df.loc[_,'Years']:
    lst.append((yr, df.loc[_,'winners']))
lst = sorted(lst, key=lambda x: x[0], reverse=True)
lst

In [ ]:
winners = []
years = []
for _ in range(len(df)):
  for yr in df.loc[_,'Years']:
    winners.append(df.loc[_,'winners'])
    years.append(yr)
df_1 = pd.DataFrame({ 'Year': years, 'Winner': winners})
df_1.sort_values(by='Year', ascending=False)

In [ ]:
txt=" 1980"
txt.strip()

In [ ]:
pd.DataFrame({'Year':[2010], 'Country':['Australia']})

In [ ]:
df_2 = pd.DataFrame(columns=['Year', 'Winner'])
for _ in range(len(df)):
  for yr in df.loc[_,'Years']:
    df_2 = pd.concat( [df_2, pd.DataFrame( {'Year':[yr], 'Winner':[df.loc[_,'winners']]} )] ).sort_values(by='Year', ascending=False)
df_2

In [ ]:
lst = [89, 89]
c, *a = lst

In [ ]:
print(c, a)

In [113]:
df = pd.DataFrame(
    {
        'Date': ['01-03-23', '02-03-23', '03-03-23', '04-03-23', '05-03-23', '06-03-23', '07-03-23', '08-03-23', '09-03-23'],
        'Amt1': [20, 280, 400, 580, 680, 810, 1040, 1230, 1290],
        'Amt2': [110, 300, 440, 630, 700, 910, 1130, 1250, 1350],
        'Amt3': [200, 340, 500, 650, 730, 950, 1180, 1260, 1400]
    }
)

In [114]:
df

       Date  Amt1  Amt2  Amt3
0  01-03-23    20   110   200
1  02-03-23   280   300   340
2  03-03-23   400   440   500
3  04-03-23   580   630   650
4  05-03-23   680   700   730
5  06-03-23   810   910   950
6  07-03-23  1040  1130  1180
7  08-03-23  1230  1250  1260
8  09-03-23  1290  1350  1400

In [126]:
df1 = pd.melt(df, id_vars=['Date'], var_name='Amt', value_name='Value').sort_values(by=['Date','Amt']).reset_index(drop=True)
lst = [df1.loc[_-1,'Value']-df1.loc[_-2,'Value'] for _ in range(len(df1),1,-1)]
lst.append(df1.loc[0,'Value'])
lst = lst[::-1]
df1['Value'] = lst
df1 = df1.pivot( index='Date', columns='Amt', values='Value' )

In [128]:
df1.index

Index(['01-03-23', '02-03-23', '03-03-23', '04-03-23', '05-03-23', '06-03-23',
       '07-03-23', '08-03-23', '09-03-23'],
      dtype='object', name='Date')

In [129]:
df1

Amt       Amt1  Amt2  Amt3
Date
01-03-23    20    90    90
02-03-23    80    20    40
03-03-23    60    40    60
04-03-23    80    50    20
05-03-23    30    20    30
06-03-23    80   100    40
07-03-23    90    90    50
08-03-23    50    20    10
09-03-23    30    60    50

In [135]:
print(df1.to_markdown())

| Date     |   Amt1 |   Amt2 |   Amt3 |
|:---------|-------:|-------:|-------:|
| 01-03-23 |     20 |     90 |     90 |
| 02-03-23 |     80 |     20 |     40 |
| 03-03-23 |     60 |     40 |     60 |
| 04-03-23 |     80 |     50 |     20 |
| 05-03-23 |     30 |     20 |     30 |
| 06-03-23 |     80 |    100 |     40 |
| 07-03-23 |     90 |     90 |     50 |
| 08-03-23 |     50 |     20 |     10 |
| 09-03-23 |     30 |     60 |     50 |

In [134]:
print(df1.to_markdown(tablefmt='grid'))

+----------+--------+--------+--------+
| Date     |   Amt1 |   Amt2 |   Amt3 |
+==========+========+========+========+
| 01-03-23 |     20 |     90 |     90 |
+----------+--------+--------+--------+
| 02-03-23 |     80 |     20 |     40 |
+----------+--------+--------+--------+
| 03-03-23 |     60 |     40 |     60 |
+----------+--------+--------+--------+
| 04-03-23 |     80 |     50 |     20 |
+----------+--------+--------+--------+
| 05-03-23 |     30 |     20 |     30 |
+----------+--------+--------+--------+
| 06-03-23 |     80 |    100 |     40 |
+----------+--------+--------+--------+
| 07-03-23 |     90 |     90 |     50 |
+----------+--------+--------+--------+
| 08-03-23 |     50 |     20 |     10 |
+----------+--------+--------+--------+
| 09-03-23 |     30 |     60 |     50 |
+----------+--------+--------+--------+

In [137]:
df_data = pd.DataFrame(
    {
        'Customer': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'],
        'Purchase': [
            {'Milk': '3,500', 'Juice': '4,500', 'Coffee': '4,800', 'Apple': '5,000', 'Tea': '6,000', 'Toothbrush': '2,000'},
            {'Toothbrush': '2,000', 'Ramen': '5,500', 'Fruit': '15,000', 'Water': '1,500'},
            {'Soap': '2,500', 'Water': '1,500', 'Shampoo': '13,500', 'Milk': '3,500', 'Soap': '2,500', 'Juice': '4,500'},
            {'Coffee': '4,800', 'Ramen': '5,500', 'Toothpaste': '3,000', 'Sweets': '3,000'},
            {'Toothbrush': '2,000', 'Ramen': '5,500', 'Toothbrush': '2,000', 'Toothbrush': '2,000', 'Water': '1,500'},
            {'Toothpaste': '3,000', 'Bread': '2,500', 'Bread': '2,500', 'Fruit Box': '1,500,000'},
            {'Asahi Beer' : '12,000', 'Coffee Mix': '4,800', 'Shin Ramyun': '5,500', 'Shampoo': '13,500', 'Milk': '3,500'},
            {'Soap': '2,500', 'Banana': '4,000', 'Toothpaste': '3,000', 'Water': '1,500'}
        ]

    }
)
df_data

  Customer                                           Purchase
0        A  {'Milk': '3,500', 'Juice': '4,500', 'Coffee': ...
1        B  {'Toothbrush': '2,000', 'Ramen': '5,500', 'Fru...
2        C  {'Soap': '2,500', 'Water': '1,500', 'Shampoo':...
3        D  {'Coffee': '4,800', 'Ramen': '5,500', 'Toothpa...
4        E  {'Toothbrush': '2,000', 'Ramen': '5,500', 'Wat...
5        F  {'Toothpaste': '3,000', 'Bread': '2,500', 'Fru...
6        G  {'Asahi Beer': '12,000', 'Coffee Mix': '4,800'...
7        H  {'Soap': '2,500', 'Banana': '4,000', 'Toothpas...

In [203]:
df = pd.read_excel(  r'C:\Users\anshu\OneDrive\Teaching Opportunities\Excel\Challenges\Excel_Challenge_503 - Payments Calculations.xlsx',
                sheet_name='Sheet1',
                usecols='A:B',
                skiprows=1,
                header=None,
                names=['Customer', 'Purchase']
            ).dropna()
tax = pd.read_excel(  r'C:\Users\anshu\OneDrive\Teaching Opportunities\Excel\Challenges\Excel_Challenge_503 - Payments Calculations.xlsx',
                sheet_name='Sheet1',
                usecols='D',
                skiprows=1,
                header=None,
                names=['Zero_Tax']
            ).dropna()
tax

    Zero_Tax
0      Apple
1      Fruit
2      Water
3       Milk
4  Fruit Box
5     Banana

In [256]:
zero_tax = list(tax['Zero_Tax'])
def calculate_tax(row):
    return 0 if row['Product'] in zero_tax else row['Amount']*0.1

df_new = pd.DataFrame(columns=['Customer', 'Product', 'Amount'])

for idx in range(len(df)):
    for prod in df.iloc[idx,1].split(', '):
        df_new = pd.concat([df_new, pd.DataFrame([(df.iloc[idx,0], *prod.replace(',','').split(': '))], columns=['Customer', 'Product', 'Amount'])], ignore_index=True)
df_new['Amount'] = df_new['Amount'].astype(int)
df_new['Tax'] = df_new.apply(calculate_tax, axis=1).round(0).astype(int)
df_new = df_new.groupby('Customer').agg( SUM=('Amount', 'sum'), AVERAGE=('Amount', lambda x: int(round(x.mean()))), MAX=('Amount', 'max'), MIN=('Amount', 'min'),COUNT=('Amount', 'count'),
    AMOUNT=('Amount', 'sum'),TAX =('Tax', 'sum')
)
df_new['Payment'] = df_new['AMOUNT']+df_new['TAX']
df_new.drop(['AMOUNT', 'TAX'], axis=1, inplace=True)
df_new

              SUM  AVERAGE      MAX   MIN  COUNT  Payment
Customer
A           25800     4300     6000  2000      6    27530
B           24000     6000    15000  1500      4    24750
C           28000     4667    13500  1500      6    30300
D           16300     4075     5500  3000      4    17930
E           13000     2600     5500  1500      5    14150
F         1508000   377000  1500000  2500      4  1508800
G           39300     7860    13500  3500      5    42880
H           11000     2750     4000  1500      4    11550

In [257]:
df_new.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'], dtype='object', name='Customer')

In [259]:
df_new.index.name=None

In [260]:
df_new

       SUM  AVERAGE      MAX   MIN  COUNT  Payment
A    25800     4300     6000  2000      6    27530
B    24000     6000    15000  1500      4    24750
C    28000     4667    13500  1500      6    30300
D    16300     4075     5500  3000      4    17930
E    13000     2600     5500  1500      5    14150
F  1508000   377000  1500000  2500      4  1508800
G    39300     7860    13500  3500      5    42880
H    11000     2750     4000  1500      4    11550